In [3]:
"""
This task is similar to the bag example of reading and performing operations on a json file, but this time it's using
a dataframe. Dataframes can be much faster than bags.
"""



import dask.bag as db
import os
import json


filename = os.path.join('../data', 'accounts.*.json.gz')
lines = db.read_text(filename)
lines.take(3)


js = lines.map(json.loads)

In [4]:
#Takes the firs few rows of the csv file
df1 = js.to_dataframe()
df1.head()

   id     name                                       transactions
0   0  Norbert  [{u'transaction-id': 384, u'amount': 781}, {u'...
1   1      Tim  [{u'transaction-id': 890, u'amount': 826}, {u'...
2   2    Frank  [{u'transaction-id': 197, u'amount': 449}, {u'...
3   3   Xavier  [{u'transaction-id': 4021, u'amount': 2819}, {...
4   4   Hannah  [{u'transaction-id': 1266, u'amount': 1302}, {...

In [5]:
%time df1.groupby('name').id.count().compute().head()

CPU times: user 12.3 s, sys: 844 ms, total: 13.2 s
Wall time: 14.1 s

name
Alice       998
Bob         800
Charlie    1050
Dan        1200
Edith       600
Name: id, dtype: int64

In [6]:
#denormalizing the data since transaction contains nested data
def denormalize(record):
    # returns a list for every nested item, each transaction of each person
    return [{'id': record['id'], 
             'name': record['name'], 
             'amount': transaction['amount'], 
             'transaction-id': transaction['transaction-id']}
            for transaction in record['transactions']]

transactions = js.map(denormalize).flatten()
transactions.take(3)

({'amount': 781, 'id': 0, 'name': u'Norbert', 'transaction-id': 384},
 {'amount': 835, 'id': 0, 'name': u'Norbert', 'transaction-id': 7392},
 {'amount': 813, 'id': 0, 'name': u'Norbert', 'transaction-id': 7774})

In [7]:
df = transactions.to_dataframe()
df.head()

   amount  id     name  transaction-id
0     781   0  Norbert             384
1     835   0  Norbert            7392
2     813   0  Norbert            7774
3     786   0  Norbert           10731
4     817   0  Norbert           12310

In [8]:
%%time
# number of transactions per name
# note that the time here includes the data load and ingestion
df.groupby('name')['transaction-id'].count().compute()

CPU times: user 22.9 s, sys: 2.39 s, total: 25.3 s
Wall time: 24.8 s

name
Alice       234975
Bob         143834
Charlie     182846
Dan         170550
Edith        84646
Frank       208614
George      178682
Hannah      225780
Ingrid      173676
Jerry       108890
Kevin       243328
Laura       181119
Michael     197105
Norbert     174424
Oliver      194031
Patricia    260822
Quinn       189476
Ray         173602
Sarah       185210
Tim         314221
Ursula      255097
Victor      223240
Wendy       150050
Xavier      219629
Yvonne      174347
Zelda       151806
Name: transaction-id, dtype: int64